#1) X1: 表示视力状况, 它是一个分类变量, 1表示好, 0表示有问题);
#2) X2: 年龄(age), 数值型);
#3) X3: 驾车(drive)教育, 它也是一个分类变量, 1表示参加过驾车教育, 0表示没有;
#4) Y : 一个分类型输出变量accident, (去年是否出过事故, 1表示出过事故,0表示没有).

x1<-rep(c(1, 0, 1, 0, 1), c(5, 10, 10, 10, 10))
x2<-c(17, 44, 48, 55, 75, 35, 42, 57, 28, 20,38, 45, 47, 52, 55, 68, 18, 68, 48, 17,70, 72, 35, 19, 62, 39, 40, 55, 68, 25,17, 45, 44, 67, 55, 61, 19, 69, 23, 19,72, 74, 31, 16, 61)
x3<-c(1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0,1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1,0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1)
y<-c(1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1,0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0,0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1,0, 1, 0, 0)
accident<-data.frame(x1, x2, x3, y)
#逻辑斯蒂回归
log.glm<-glm(y~x1+x2+x3, family=binomial, data=accident)
summary(log.glm)
#模型的诊断与更新,在此模型中, 由于参数¯2; ¯3没有通过检验, 可类似于线性模型, 用step()做变量筛选.
log.step<-step(log.glm)
summary(log.step)
log.pre<-predict(log.step, data.frame(x1=1))
p1<-exp(log.pre)/(1+exp(log.pre))
p1
log.pre<-predict(log.step, data.frame(x1=0))
p2<-exp(log.pre)/(1+exp(log.pre))
p2
